app/controllers/books_controller.rb

	def index
   	   @books = Book.all
---
SELECT "books".* FROM "books" WHERE (name LIKE 'hiiii' )

  	def create

  		@book = Book.new(book_params)
  		@book.attachment = params[:book][:attachment]
  		@book.user_id = current_user.id
   		if @book.save
---
INSERT INTO "books" ("title", "text", "created_at", "updated_at", "user_id", "attachment") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "helpy"], ["text", "nndsfkankl;csdl;amclk'wm"], ["created_at", "2018-05-07 11:33:16.490860"], ["updated_at", "2018-05-07 11:33:16.490860"], ["user_id", 1], ["attachment", "Q19.png"]]

	def find_user
		@book= Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]